// Вивести іформацію на консоль

Console.WriteLine("My first text in that program");
Console.WriteLine("Hello peple!");


//Змінні та константи
string name;
name = "Vitaliy";
byte age = 27;
const string NAME_LANGUAGE = "C#";

/*
Типи даних

bool (System.Boolean): true або false

byte (System.Byte): ціле число від 0 до 255 і займає 1 байт / 8 біт ( від 0 до 2^8-1 )
sbyte (System.SByte): зберігає ціле число від -128 до 127 і займає 1 байт ( від -2^(8-1) до 2^(8-1)-1 )

short (System.Int16): зберігає ціле число від -32768 до 32767 і займає 2 байти / 16 біт ( від -2^(16-1) до 2^(16-1)-1 )
ushort (System.UInt16): зберігає ціле число від 0 до 65535 і займає 2 байти ( від 0 до 2^16-1 )

int (System.Int32): зберігає ціле число від -2147483648 до 2147483647 і займає 4 байти / 32 біти ( від -2^(32-1) до 2^(32-1-1)-1 )
uint (System.UInt32): зберігає ціле число від 0 до 4294967295 і займає 4 байти ( від 0 до 2^32-1 )

long (System.Int64): зберігає ціле число від -9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 і займає 8 байт / 64 біт ( від -2^(64-1) до 2^(64-1)-1 )
ulong (System.UInt64): зберігає ціле число від 0 до 18 446 744 073 709 551 615 і займає 8 байт ( від 0 до 2^64-1 )

float (System.Single): зберігає число з плаваючою крапкою від -3.4*1038 до 3.4*1038 і займає 4 байти, може зберігати 7 знаків після коми
double (System.Double): зберігає число з плаваючою крапкою від ±5.0*10-324 до ±1.7*10308 і займає 8 байтів, може зберігати 14 знаків після коми
decimal (System.Decimal): зберігає десяткове дробове число  від ±1.0*10-28 до ±7.9228*1028, може зберігати 28 знаків після коми

char (System.Char): зберігає одиночний символ у кодуванні Unicode і займає 2 байти
string (System.String): зберігає набір символів Unicode. Цьому типу відповідають рядкові літерали.

object (System.Object): може зберігати значення будь-якого типу даних і займає 4 байти на 32-розрядній платформі та 8 байт на 64-розрядній платформі. Є базовим для всіх інших типів і класів .NET.
*/

float myFloat = 5.6f;
System.Console.WriteLine(myFloat);

/*
Консольне введення-виведення
Арифметичні операції
Порозрядні операції
Операції присвоювання
Перетворення базових типів даних
Умовні вирази
Конструкція if..else і тернарна операція
Цикли
Масиви
Задачі з масивами
Методи
Параметри методів
Повернення значення та оператор return
Передача параметрів за посиланням і значенням. Вихідні параметри
Масив параметрів і ключове слово params
Рекурсивні функції
Локальні функції
Конструкція switch
Перерахування enum

*/